validation-seabed-scouring-by-square-jet/hydrodynamics-calibration/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 -0.05) //0
    (6 0 -0.05)  //1
    (6 0.05 -0.05) //2
    (0 0.05 -0.05) //3
    (0 0  0.05)   //4
    (6 0  0.05)  //5
    (6 0.05  0.05) //6
    (0 0.05  0.05) //7
    
    (6 0.15 -0.05) //8
    (0 0.15 -0.05) //9
    (6 0.15  0.05) //10
    (0 0.15  0.05) //11
    
    (6 0.6 -0.05) //12
    (0 0.6 -0.05) //13
    (6 0.6  0.05) //14
    (0 0.6  0.05) //15
);

blocks
(
    hex (0  1  2  3 4 5  6  7) (600 5 1) simpleGrading (1 1 1)
    hex (3  2  8  9 7 6 10 11) (600 10 1) simpleGrading (1 1 1)
    hex (9 8 12 13 11 10 14 15) (600 45 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (9 11 15 13)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (3 7 11 9)
        );
    }
    side1
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (7 6 10 11)
            (11 10 14 15)
        );
    }
    
    side2
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (3 2 8 9)
            (9 8 12 13)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (2 6 10 8)
            (8 10 14 12)
        );
    }
    top
    {
        type patch;
        faces
        (
            (13 12 14 15)
        );
    }
    down
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

);

// ************************************************************************* //
