validation-seabed-scouring-by-square-jet/hydrodynamics-calibration/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1e-5;

boundaryField
{
    "(right|top)"
    {
        type            zeroGradient;
    }

    inlet
    {
         type           fixedValue;
         value          uniform 0.000732;
    }
    
    "(left|down)"
    {
         type           zeroGradient;
    }

    "(side1|side2)"
    {
        type            empty;
    }

}


// ************************************************************************* //
