validation-seabed-scouring-by-square-jet/hydrodynamics-calibration/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    arch        "LSB;label=32;scalar=64";
    location    "1e-05";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    "(down|left)"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    "(right|top)"
    {
        type            zeroGradient;
    }

    "(inlet)"
    {
        type calculated;
        value uniform 0;
    }

    "(side1|side2)"
    {
        type            empty;
    }

}


// ************************************************************************* //
